import type { Project } from "./types";

export const shelkoPrint: Project = {
  id: "shelko-print",

  title: 'ШелкоПринт',

  category: "full-stack",

  year: "2025",

  shortDescription:
    "Бесценный опыт работы с ТЗ, которое продолжало жить своей жизнью.",

  description:
    'Это мой первый проект для настоящего заказчика - и, пожалуй, первый проект, который очень быстро объяснил мне, почему разработчики так любят подробные технические задания. Изначальный план был максимально оптимистичным: «Ну, думаю, за две недели управлюсь». Спойлер: не управилась. Поскольку заказчик не был связан с разработкой, техническое задание оказалось довольно расплывчатым. Уже в процессе работы появлялись новые пожелания, уточнения и дополнения. В результате две недели постепенно превратились в три месяца разработки и доработок. Но именно это и сделало проект особенно полезным. Мне впервые пришлось работать не по учебному ТЗ, где все требования заранее прописаны преподавателем, а с реальным человеком, который мог посмотреть на готовую страницу и сказать: «А можно ещё вот здесь немного по-другому?» Так я получила первый опыт общения с заказчиком, уточнения требований, работы с изменениями и понимания того, что иногда самая сложная часть разработки — вовсе не JavaScript. В итоге сайт был завершён, заказчик остался доволен, а я получила свой первый коммерческий проект и небольшую прививку от фразы «да тут работы на пару недель».',

  technologies: [
    "HTML",
    "CSS",
    "JavaScript",
    "PHP"
  ],

  previewImage:
    "/projects/shelkoPrint/preview.webp",

  gallery: [
    "/projects/shelkoPrint/01.webp",
    "/projects/shelkoPrint/02.webp",
    "/projects/shelkoPrint/03.webp",
    "/projects/shelkoPrint/04.webp",
  ],

  githubUrl:
    undefined,

  liveUrl: "https://shelko-print.ru/",

  featured: true,
};